// Առաջադրանք
// Ստեղծել զանգված data անունով և նրա մեջ պահել 1,2,3 թվերը;
// Destructure-ի օգնությամբ զանգվածի առաջին անդամի արժեքը 
// պահել a փոփոխականի տակ,
// բաց թողեք զանգվածի 2-րդ արժեքը,
// b փոփոխականի մեջ պահել զանգվածի 3-րդ արժեքը,
// և ստեղծել c փոփոխական,որը կունենա 4 արժեքը։
// Տպել բոլոր փոփոխականների արժեքները։
const data = [1, 2, 3];
let [a,, b, c = 4] = data;

console.log(a, b, c);

// Առաջադրանք
// Ստեղծել օբյեկտ,որը կպարունակի f1,f2,f3 բանալիներն ու 
// համապատասխանաբար v1,2,v3 արժեքները։Destructure-ի օգնությամբ 
// ստեղծել f1 ևնրա մեջ պահել f1 բանալու արժեքը,f2 բանալու անունը 
// փոխել  field2 անվամբ,ստեղծել  f4 բանալի և նրան վերագրել 
// v4 արժեքը։Տպել բոլոր փոփոխականների արժեքները։
let obj = {
    f1: "v1",
    f2: "v2",
    f3: "v3",
};

let {f1, f2: field2} = obj;
obj.f4 = "v4";

console.log(f1, field2);

// Առաջադրանք
// Ստեղծել գիրք օբյեկտ,որը կպարունակի ՝ գրքի անունը,հեղինակի անունը,
// ժանրը և հրատարակման օրը,ամիսը,տարին։ Destructure-ի օգնությամբ ստեղծել 
// bookTitle և bookAuthor փոփոխականները և նրանց մեջ համապատասխանաբար պահել 
// գրքի անունը և հեղինակի անունը։Օգտագործելով  document.write 
// մեթոդը էկրանին տպել հետևյալ նախադասությունը՝ 
// "Մատանիների տիրակալ գիրքը գրվել է J.R.R Tolkien-ի կողմից",
// որտեղ գրքի անվան և հեղինակի անվան փոխարեն 
// պետք է տեղադրեք ձեր փոփոխականները։
let book = {
    name: "Մատանիների տիրակալ",
    author: "J.R.R Tolkien",
    janr: "detektiv",
    or: "04",
    amis: "07",
    tari: "2010"
}

let { name:bookTitle, author:bookAuthor } = book;
document.write(`${bookTitle} գիրքը գրվել է ${bookAuthor}-ի կողմից`);


