// Առաջադրանք
// Ստեղծիր 4 փոփոխականներ, երկուսը թվային տիպի, իսկ մյուս երկուսը տողային տիպի։ Գրեք ծրագիր, որը կտպի
//      Թվային փոփոխականների գումարը
//      Թվային փոփոխականների արտադրյալը
//      Թվային փոփոխականների տարբերությունը
//      Թվային փոփոխականների տարբերությանը գումարած թվային փոփոխականների արտադրյալը
//      Տողային փոփոխականների կոնկատենացիան
//      Տողային 1 փոփոխականին ավելացրած թվային փոփոխականների արտադրյալը
let a = 5, b = 2, str1 = "Hello.", str2 = "My name is Laura.";

console.log(a + b);

let c = a * b;
console.log(c);

let d = a - b;
console.log(d);

console.log(d + c);
console.log(str1 + str2);
console.log(str1 + c);

// Առաջադրանք
// Oգտատիրոջը առաջարկել գրել իր անունը (prompt հրամանի միջոցով)` արտածել Բարև + “անուն“տողը
// Օրինակ` ներմուծվում է “Վարդան“ `alert-ը վերադարձնում է “Բարև Վարդան“
let name1 = prompt("Մուտքագրեք Ձեր անունը:");
alert(`Բարև ${name1}`);

// Առաջադրանք
// Ստեղծել 2 prompt պատուհան։ Իրենց միջոցով alert պատուհանում հաշվել տարիք։
let birthday = +prompt("Input your birthday year");
let year = +prompt("Input year");
alert(year - birthday);

// Առաջադրանք
// Ստեղծել փոփոխական, որի մեջ կունենանք րոպե։ Եվ տրված րոպեն կձևափոխի վայրկյանի։
let minute = 12;
console.log(minute * 60);

// Առաջադրանք
// Ձեր առաջադրանքը կայանում է նրանում, որպեսզի կազմեք 4 փոփոխականներ (անվանումներն ընտրեք ինքնուրույն):
// 1. Օրերի քանակի համար, արժեքը նշեք 365
// 2. Մեր մոլորակի անվանման համար, արժեքը՝ "Երկիր"
// 3. Մարդկանց թիվը մոտ ապագայում, արժեքը՝ "9 մլրդ."
// 4. "Արև" բառի համար.
// Այնուհետև օգտագործելով տեքստ և այդ փոփոխականները, այնպես արեք, որ արդյունքում համակարգչի էկրանին պատկերվի հետևյալ նախադասությունը՝
// "Մենք ապրում ենք Երկիր մոլորակում, որը պտտվում է Արևի շուրջը 365 օրում: Մեր մոլորակում մարդկանց թիվը մոտ ապագայում կհասնի մոտավորապես 9 մլրդ.-ի:"
let numberOfDays = 365;
let planet = "Երկիր";
let numberOfPeople = "9 մլրդ.";
let sun = "Արև";
let text = `Մենք ապրում ենք ${planet} մոլորակում, որը պտտվում է ${sun}ի շուրջը ${numberOfDays} օրում: Մեր մոլորակում մարդկանց թիվը մոտ ապագայում կհասնի մոտավորապես ${numberOfPeople}-ի:`
console.log(text);